c5/src/Documents/SalesOrder/SalesOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>SalesOrder</name>
  <basedOn>Document.Quote</basedOn>
  <basedOn>Document.IOSheet</basedOn>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.Allocation</registerRecords>
  <registerRecords>AccumulationRegister.SalesOrderDebts</registerRecords>
  <registerRecords>AccumulationRegister.SalesOrders</registerRecords>
  <registerRecords>AccumulationRegister.Provision</registerRecords>
  <registerRecords>AccumulationRegister.Items</registerRecords>
  <registerRecords>AccumulationRegister.Debts</registerRecords>
  <registerRecords>AccumulationRegister.InvoiceDebts</registerRecords>
  <registerRecords>AccumulationRegister.Reserves</registerRecords>
  <attributes>
    <name>Action</name>
    <type>
      <types>EnumRef.Actions</types>
    </type>
  </attributes>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Contracts</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Currency</name>
    <type>
      <types>CatalogRef.Currencies</types>
    </type>
  </attributes>
  <attributes>
    <name>Customer</name>
    <type>
      <types>CatalogRef.Organizations</types>
    </type>
  </attributes>
  <attributes>
    <name>DeliveryDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Department</name>
    <type>
      <types>CatalogRef.Departments</types>
    </type>
  </attributes>
  <attributes>
    <name>Discount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Factor</name>
    <type>
      <types>DefinedType.Factor</types>
    </type>
  </attributes>
  <attributes>
    <name>GrossAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Guarantee</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>IOSheet</name>
    <type>
      <types>DocumentRef.IOSheet</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Performer</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>PO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Prices</name>
    <type>
      <types>CatalogRef.Prices</types>
    </type>
  </attributes>
  <attributes>
    <name>Process</name>
    <type>
      <types>BusinessProcessRef.SalesOrder</types>
    </type>
  </attributes>
  <attributes>
    <name>Quote</name>
    <type>
      <types>DocumentRef.Quote</types>
    </type>
  </attributes>
  <attributes>
    <name>Rate</name>
    <type>
      <types>DefinedType.Rate</types>
    </type>
  </attributes>
  <attributes>
    <name>Resolution</name>
    <type>
      <types>EnumRef.Resolutions</types>
    </type>
  </attributes>
  <attributes>
    <name>Tax</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Taxable</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxableAmount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxCode</name>
    <type>
      <types>CatalogRef.TaxCodes</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxGroup</name>
    <type>
      <types>CatalogRef.TaxGroups</types>
    </type>
  </attributes>
  <attributes>
    <name>TaxRate</name>
    <type>
      <types>DefinedType.TaxRate</types>
    </type>
  </attributes>
  <attributes>
    <name>VAT</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>VATUse</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Changes</name>
    <attributes>
      <name>Date</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Information</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>400</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Reason</name>
      <type>
        <types>EnumRef.ChangeReasons</types>
      </type>
    </attributes>
    <attributes>
      <name>User</name>
      <type>
        <types>CatalogRef.Users</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrder</name>
      <type>
        <types>DocumentRef.ProductionOrder</types>
        <types>DocumentRef.PurchaseOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>DocumentOrderRowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Reservation</name>
      <type>
        <types>EnumRef.Reservation</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Stock</name>
      <type>
        <types>CatalogRef.Warehouses</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxableAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Payments</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>PaymentDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Option</name>
      <type>
        <types>CatalogRef.PaymentOptions</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Services</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DeliveryDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Department</name>
      <type>
        <types>CatalogRef.Departments</types>
      </type>
    </attributes>
    <attributes>
      <name>Description</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Discount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>DiscountRate</name>
      <type>
        <types>DefinedType.Percent</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Performer</name>
      <type>
        <types>EnumRef.Performers</types>
      </type>
    </attributes>
    <attributes>
      <name>Price</name>
      <type>
        <types>DefinedType.Price</types>
      </type>
    </attributes>
    <attributes>
      <name>Prices</name>
      <type>
        <types>CatalogRef.Prices</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Taxable</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxableAmount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>TaxCode</name>
      <type>
        <types>CatalogRef.TaxCodes</types>
      </type>
    </attributes>
    <attributes>
      <name>Total</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VAT</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>VATCode</name>
      <type>
        <types>CatalogRef.VAT</types>
      </type>
    </attributes>
    <attributes>
      <name>VATRate</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Taxes</name>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Percent</name>
      <type>
        <types>DefinedType.TaxRate</types>
      </type>
    </attributes>
    <attributes>
      <name>Tax</name>
      <type>
        <types>CatalogRef.TaxItems</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/InformationRegisters/SalesOrderStatuses/SalesOrderStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>SalesOrderStatuses</name>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.SalesOrderPoints</types>
    </type>
  </resources>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/AccumulationRegisters/SalesOrders/SalesOrders.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>SalesOrders</name>
  <resources>
    <name>Quantity</name>
    <type>
      <types>DefinedType.Quantity</types>
    </type>
  </resources>
  <resources>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </resources>
  <dimensions>
    <name>SalesOrder</name>
    <type>
      <types>DocumentRef.SalesOrder</types>
    </type>
  </dimensions>
  <dimensions>
    <name>RowKey</name>
    <type>
      <types>CatalogRef.RowKeys</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

c5/src/Enums/Actions/Actions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Actions</name>
  <enumValues>
    <name>Approve</name>
  </enumValues>
  <enumValues>
    <name>CommitRejection</name>
  </enumValues>
  <enumValues>
    <name>CompleteApproval</name>
  </enumValues>
  <enumValues>
    <name>CompleteDelivery</name>
  </enumValues>
  <enumValues>
    <name>CompleteEdition</name>
  </enumValues>
  <enumValues>
    <name>CompleteInventory</name>
  </enumValues>
  <enumValues>
    <name>CompleteInvoicing</name>
  </enumValues>
  <enumValues>
    <name>CompletePicking</name>
  </enumValues>
  <enumValues>
    <name>CompleteShipment</name>
  </enumValues>
  <enumValues>
    <name>Post</name>
  </enumValues>
  <enumValues>
    <name>Complete</name>
  </enumValues>
  <enumValues>
    <name>Return</name>
  </enumValues>
  <enumValues>
    <name>Reject</name>
  </enumValues>
  <enumValues>
    <name>SendToApproval</name>
  </enumValues>
  <enumValues>
    <name>StartPicking</name>
  </enumValues>
  <enumValues>
    <name>Resolve</name>
  </enumValues>
  <enumValues>
    <name>Rework</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/Resolutions/Resolutions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Resolutions</name>
  <enumValues>
    <name>Approve</name>
  </enumValues>
  <enumValues>
    <name>Rework</name>
  </enumValues>
  <enumValues>
    <name>Reject</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/SalesOrder/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var Env;
var Command;
var Task;
var RoutePoint;

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )

	checkWarehouse ( CheckedAttributes );
	if ( not PaymentsTable.Check ( ThisObject ) ) then
		Cancel = true;
		return;
	endif;
	if ( not DeliveryRows.Check ( ThisObject, "Items" )
		or not DeliveryRows.Check ( ThisObject, "Services" ) ) then
		Cancel = true;
		return;
	endif; 
	
EndProcedure

Procedure checkWarehouse ( CheckedAttributes )
	
	if ( Items.Count () > 0 ) then
		CheckedAttributes.Add ( "Warehouse" );
	endif; 
	
EndProcedure 

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	defineCommand ();
	defineTask ();
	SetPrivilegedMode ( true );
	if ( DeletionMark ) then
		if ( not canRemove () ) then
			Cancel = true;
		endif; 
		removeRelations ();
		return;
	else
		if ( isRemoved () ) then
			Cancel = true;
			return;
		endif; 
	endif; 
	createProcess ();
	SetPrivilegedMode ( false );
	
EndProcedure

Procedure defineCommand ()
	
	if ( Action.IsEmpty () ) then
		Command = undefined;
	else
		Command = Action;
		Action = undefined;
	endif; 
	
EndProcedure 

Procedure defineTask ()
	
	if ( IsNew () ) then
		Task = undefined;
		RoutePoint = Enums.SalesOrderPoints.New;
	else
		getTask ();
		Task = ? ( Env.Tasks = undefined, undefined, Env.Tasks.Task );
		RoutePoint = ? ( Env.Statuses = undefined, Enums.SalesOrderPoints.New, Env.Statuses.Status );
	endif;
	
EndProcedure 

Procedure getTask ()
	
	s = "
	|// @Tasks
	|select top 1 Tasks.Ref as Task
	|from Task.Task.TasksByExecutive ( &Performer, BusinessProcess = &Process ) as Tasks
	|where not Tasks.Executed
	|and not Tasks.DeletionMark
	|;
	|// @Statuses
	|select Statuses.Status as Status
	|from InformationRegister.SalesOrderStatuses as Statuses
	|where Statuses.Document = &Ref
	|";
	Env = SQL.Create ( s );
	Env.Q.SetParameter ( "Performer", Performer );
	Env.Q.SetParameter ( "Process", Process );
	Env.Q.SetParameter ( "Ref", Ref );
	SQL.Perform ( Env );
	
EndProcedure

Function canRemove ()
	
	if ( IsInRole ( "Administrator" ) ) then
		return true;
	endif; 
	if ( not Process.IsEmpty () ) then
		Output.OrderCannotBeChanged ();
		return false;
	endif; 
	return true;
	
EndFunction 

Procedure removeRelations ()
	
	BP.RemoveTasks ( Process );
	BP.Remove ( Process );
	Process = undefined;
	Posting.ClearRecords ( RegisterRecords );
	removeStatus ();
	
EndProcedure 

Procedure removeStatus ()
	
	record = InformationRegisters.SalesOrderStatuses.CreateRecordManager ();
	record.Document = Ref;
	record.Delete ();
	
EndProcedure 

Function isRemoved ()
	
	if ( IsNew () or IsInRole ( "Administrator" ) ) then
		return false;
	endif; 
	removed = DF.Pick ( Ref, "DeletionMark as DeletionMark" );
	if ( removed ) then
		Output.DocumentIsRemoved ();
		return true;
	endif; 
	return false;
	
EndFunction 

Procedure createProcess ()
	
	if ( Command <> Enums.Actions.SendToApproval ) then
		return;
	endif; 
	if ( IsNew () ) then
		SetNewObjectRef ( Documents.SalesOrder.GetRef ( new UUID () ) );
		documentRef = GetNewObjectRef ();
	else
		documentRef = Ref;
	endif; 
	approval = BusinessProcesses.SalesOrder.CreateBusinessProcess ();
	approval.Date = CurrentSessionDate ();
	approval.SalesOrder = documentRef;
	approval.Write ();
	Process = approval.Ref;
	
EndProcedure 

Procedure OnWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	SetPrivilegedMode ( true );
	if ( not checkSales ()
		or not performCommand () ) then
		Cancel = true;
		return;
	endif; 
	sendEmails ();
	
EndProcedure

Function checkSales ()
	
	if ( Command = undefined
		or Command = Enums.Actions.Reject ) then
		return true;
	else
		return Constraints.CheckSales ( ThisObject );
	endif;

EndFunction

Function performCommand ()
	
	cmd = Enums.Actions;
	if ( Command = undefined ) then
		return true;
	elsif ( Command = cmd.SendToApproval ) then
		startProcess ();
		if ( mustBePosted () ) then
			return post ();
		endif; 
	elsif ( Command = cmd.CompleteApproval ) then
		executeTask ();
		return post ();
	elsif ( Command = cmd.CompleteEdition ) then
		if ( mustBePosted () ) then
			return post ();
		endif; 
	elsif ( Command = cmd.CompleteShipment
		or Command = cmd.CompleteInvoicing ) then
		if ( balanceExists () ) then
			return false;
		else
			executeTask ();
		endif; 
	elsif ( Command = cmd.Reject ) then
		clearRecords ();
		executeTask ();
	else
		executeTask ();
	endif; 
	return true;
	
EndFunction 

Procedure startProcess ()
	
	obj = Process.GetObject ();
	obj.Start ();
	
EndProcedure

Procedure executeTask ()
	
	obj = Task.GetObject ();
	obj.ExecuteTask ();
	
EndProcedure 

Function post ()
	
	Env = Posting.GetParams ( Ref, RegisterRecords );
	return Documents.SalesOrder.Post ( Env );
	
EndFunction 

Function mustBePosted ()
	
	s = "
	|select top 1 1
	|from Task.Task as Tasks
	|where Tasks.BusinessProcess in ( select Process from Document.SalesOrder where Ref = &Ref )
	|and not Tasks.DeletionMark
	|and ( Tasks.RoutePoint in (
	|		value ( BusinessProcess.SalesOrder.RoutePoint.Shipping ),
	|		value ( BusinessProcess.SalesOrder.RoutePoint.Invoicing ) )
	|	or ( Tasks.BusinessProcess.Completed
	|		and &Resolution = value ( Enum.Resolutions.Approve ) ) )
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	q.SetParameter ( "Resolution", Resolution );
	return not q.Execute ().IsEmpty ();
	
EndFunction 

Procedure clearRecords ()
	
	Posting.ClearRecords ( RegisterRecords );
	
EndProcedure 

Function balanceExists ()
	
	s = "
	|select top 1 1
	|from AccumulationRegister.SalesOrders.Balance ( , SalesOrder = &Ref ) as Balances
	|where Balances.QuantityBalance > 0
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	error = q.Execute ().Select ().Next ();
	if ( error ) then
		Output.SalesOrderClosingError ();
	endif; 
	return error;
	
EndFunction 

Procedure sendEmails ()
	
	if ( Command = undefined
		or Command = Enums.Actions.CompleteEdition ) then
		return;
	endif; 
	p = new Structure ();
	p.Insert ( "Ref", Ref );
	p.Insert ( "Sender", Performer );
	p.Insert ( "LastRoutePoint", RoutePoint );
	p.Insert ( "Process", Process );
	args = new Array ();
	args.Add ( p );
	Jobs.Run ( "SalesOrderMailing.Send", args, , , TesterCache.Testing () );	
	
EndProcedure 

#endif
